# Conf
cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"

# Brew
brew "openssl"
brew "wget"
brew "htop"
brew "bat"
brew "yarn"
brew "nvm"
brew "maven"

# Casks
cask "google-chrome"
cask "java"
cask "java6"
cask "java7"
cask "java8"
cask "alfred"
cask "caffeine"
cask "sequel-pro"
cask "slack"
cask "vlc"
cask "the-unarchiver"
cask "firefox"
cask "sourcetree"
cask "eclipse-java"
cask "android-studio"
cask "tunnelblick"
cask "charles"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "docker"
cask "kitematic"
cask "dropbox"
cask "fantastical"
cask "jxplorer"
cask "macdown"
cask "moneymoney"
cask "nextcloud"
cask "omnigraffle"
cask "overkill"
cask "paw"
cask "parallels10"
cask "psequel"
cask "robo-3t"
cask "simpholders"
cask "sublime-text"
cask "superduper"
cask "fastlane"
cask "istat-menus5"
cask "vanilla"

# Quicklook Plugins
# Preview source code files with syntax highlighting
cask "qlcolorcode"
# Preview plain text files without or with unknown file extension. Example: README, CHANGELOG, index.styl, etc.
cask "qlstephen"
# Preview Markdown files
cask "qlmarkdown"
# Preview JSON files
cask "quicklook-json"

# AppStore
# mas Asset Catalog Creator
mas "magnet", id:441258766
mas "ssh-proxy", id:597790822
mas "things", id:904280696
mas "xcode", id:497799835
mas "1password", id:443987910
