# Conf
cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"

# Brew
brew "bat"
brew "cocoapods"
brew "htop"
brew "maven"
brew "nvm"
brew "openssl"
brew "testdisk"
brew "tldr"
brew "wget"
brew "yarn"

# Casks
cask "1password"
cask "aerial"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "boxcryptor"
cask "charles"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "deepl"
cask "docker"
cask "eclipse-ide"
cask "fantastical"
cask "fastlane"
cask "fork"
cask "franz"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "intellij-idea"
cask "istat-menus5"
cask "java8"
cask "java11"
cask "jxplorer"
cask "kitematic"
cask "macdown"
cask "macpass"
cask "macpass"
cask "mactracker"
cask "microsoft-teams"
cask "moneymoney"
cask "nextcloud"
cask "omnigraffle"
cask "paw"
cask "robo-3t"
cask "sequel-pro"
cask "sublime-text"
cask "superduper"
cask "the-unarchiver"
cask "tripmode"
cask "virtualbox"
cask "viscosity"
cask "yammer"

# Quicklook Plugins
# Preview source code files with syntax highlighting
cask "qlcolorcode"
# Preview plain text files without or with unknown file extension. Example: README, CHANGELOG, index.styl, etc.
cask "qlstephen"
# Preview Markdown files
cask "qlmarkdown"
# Preview JSON files
cask "quicklook-json"

# AppStore
# mas Asset Catalog Creator
mas "1blocker", id:1107421413
mas "airmail-3", id:918858936
mas "amphetamine", id:937984704
mas "asset-catalog-creator", id:866571115
mas "magnet", id:441258766
mas "microsoft-office-365", id:1450038993
mas "outlineedit", id:878995413
mas "pixelmator", id:407963104
mas "ssh-proxy", id:597790822
mas "things", id:904280696
